app/controllers/movies_controller.rb

  def index
    @movies= Movie.all
    @sort_by= params[:sort_by] || session[:sort_by]
    @all_ratings= Movie.order(:rating).select(:rating).map(&:rating).uniq
    @ratings =params[:ratings]||session[:ratings]

    if(@ratings)
      session[:ratings]=@ratings
      @movies= Movie.where(rating: @ratings.keys)
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies"."rating" FROM "movies"  ORDER BY "movies"."rating" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY release_date